[
  {
    "id": 12,
    "title": "Deploy containers automatically from Github with CI/CD",
    "date": "April 1st, 2022",
    "url": "deploy-docker-automatically-from-github",
    "component": "DockerCICD.js",
    "assets": "/Assets/Blog/Docker-Github-CI-CD",
    "description": "Deploying a service can be quite a challenge. Moreover, if your app got a lot of iterations, you will need to deploy it multiple times. So, today, I'm going to show you how to automate this process with Docker and Github.",
    "keywords": "docker, docker-compose, docker swarm, services, docker services, swarm, github, ci, cd, ci/cd, automation, script, easy, ssh, github actions, actions, workflow"
  },
  {
    "id": 11,
    "title": "Automatically scale all your docker services!",
    "date": "March 28th, 2022",
    "url": "automatically-scale-your-docker-services",
    "component": "ScaleDockerServices.js",
    "assets": "/Assets/Blog/Scale-Docker-Services",
    "description": "Docker provides great functionalities, however, an automated way to scale your services is not included. That's why I'm going to share you how to do it. Within a couple of minutes!",
    "keywords": "docker, docker-compose, docker swarm, services, docker services, swarm, scaling, python, easy, fast"
  },
  {
    "id": 10,
    "title": "Deploy your NextJS App to Docker within 5 minutes!",
    "date": "March 26th, 2022",
    "url": "deploy-next-js-app-to-docker",
    "component": "DeployNextJS.js",
    "assets": "/Assets/Blog/Deploy-NextJS",
    "description": "NextJS allow you to deploy React apps with improvements like SSR very easily. Today, we're going to deploy one within 5 minutes!",
    "keywords": "react, nextjs, docker, ssr, deploy, 5 minutes, app, docker-compose, dockerfile, nodejs"
  },
  {
    "id": 9,
    "title": "Handle React Router V6 with React 18 and React Three Fiber.",
    "date": "April 1st, 2022",
    "url": "handle-react-router-v6-with-react-18-and-react-three-fiber",
    "component": "HandleReactRouter.js",
    "assets": "/Assets/Blog/Handle-React-Router",
    "description": "React Router V6, breaks the React Three Fiber hacks to use the history. Today, you'll learn how to fix it!",
    "keywords": "react, react-router, react-router-v6, reactjs, react18, createroot, concurrent, react three fiber, r3f, threejs, drei, easy, fix"
  },
  {
    "id": 8,
    "title": "Create a map with Grafana",
    "date": "March 22th, 2022",
    "url": "map-with-grafana",
    "component": "MapWithGrafana.js",
    "assets": "/Assets/Blog/Map-Grafana",
    "description": "A recent update of Grafana rolled out a new map component called Geomap. Today, we're going to setup our own map by using the lookup mode.",
    "keywords": "MySQL, Grafana, data sources, database, graph, stats, map, geomap, heatmap, lookup, analytics, easy, fast, tutorial"
  },
  {
    "id": 7,
    "title": "Use MySQL as a datasource for your Grafana!",
    "date": "March 20th, 2022",
    "url": "stats-with-mysql",
    "component": "StatsWithMysql.js",
    "assets": "/Assets/Blog/Stats-Mysql",
    "description": "MySQL is one of the most used database system. You can store almost everything here. So, today, we're going to add our Mysql database as a Grafana data source.",
    "keywords": "MySQL, Grafana, data sources, database, graph, stats, analytics, easy, fast, tutorial"
  },
  {
    "id": 6,
    "title": "Deploy a secure MariaDB on Docker Swarm!",
    "date": "February 09th, 2022",
    "url": "deploy-mariadb",
    "component": "DeploySecureMariaDB.js",
    "assets": "/Assets/Blog/Deploy-MariaDB",
    "description": "Docker brings great functionalities, however, with great functionalities comes great responsibility. Storing your data must be important at every step of a project. Moreover, GDRP must be respected to enter in the european market! Today, we're going to do a step by step install of a MariaDB on Docker Swarm!",
    "keywords": "Docker, docker stack, docker service, MySQL, MariaDB, docker swarm, secure, GDRP, european, docker secret, data, tutorial"
  },
  {
    "id": 5,
    "title": "Monitor your server with Prometheus and Grafana!",
    "date": "November 29th, 2021",
    "url": "monitor-with-prometheus-and-grafana",
    "component": "MonitorContainers.js",
    "assets": "/Assets/Blog/Monitoring-Docker",
    "description": "Nowadays, to provide the best QOF (Quality of services) to our clients, we must take carof many data. A lot of data... So, this article will deal with Prometheus and Grafana. I'm going to show you the installation process with Docker!",
    "keywords": "Docker, Grafana, Prometheus, install, installation, qof, data, monitoring, monitor, stats, analytics, docker swarm, tutorial"
  },
  {
    "id": 4,
    "title": "Dockerize Wordpress!",
    "date": "October 26th, 2021",
    "url": "dockerize-wordpress",
    "component": "DockerizeWordpress.js",
    "assets": "/Assets/Blog/Dockerize-Wordpress",
    "description": "Nowadays, more and more consumers are using Wordpress to develop their bussiness, especially in the cloud. So, this article will show you how to dockerize Wordpresss !",
    "keywords": "Docker, Wordpress, docker swarm, MySQL, MariaDB, Traefik, PHP, load balancing, data, websites, easy, fast"
  },
  {
    "id": 3,
    "title": "Internship at Autoliv!",
    "date": "June 29th, 2021",
    "url": "internship-at-autoliv",
    "component": "InternshipAtAutoliv.js",
    "assets": "/Assets/Blog/Autoliv",
    "description": "",
    "keywords": ""
  },
  {
    "id": 2,
    "title": "Enhance your syncing security!",
    "date": "January 5th, 2021",
    "url": "enhance-your-syncing-security",
    "component": "CryptomatorSyncing.js",
    "assets": "/Assets/Blog/Cryptomator",
    "description": "This short guide will be based on my previous guide about Syncing your devices easily with Syncthing. To begin with, we’ll be using Cryptomator a free, open-source program that crypt your data with keys.",
    "keywords": "Syncthing, Cryptomator, syncing, tutorial, easy, guide, free"
  },
  {
    "id": 1,
    "title": "How to synchronize your devices easily!",
    "date": "January 5th, 2021",
    "url": "how-to-synchronize-your-devices-easily",
    "component": "SynchronizeDevices.js",
    "assets": "/Assets/Blog/Syncthing",
    "description": "Syncing your devices is very useful these times, you can share folders, files… between a fleet of personal devices. Syncthing is one of the most used resource to sync. Especially because it’s a free and open-sources project. Today, this article will deal with Syncthing and how to synchronize 2 devices (Linux & Windows).",
    "keywords": "Syncing, folders, files, Syncthing, devices, easy, fast, open sources, windows, linux"
  }
]
